AUTO_config_TK_pesok/src/Catalogs/КассыКомпании/КассыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыКомпании</name>
  <comment>Кассы компании</comment>
  <attributes>
    <name>Организация</name>
    <comment>Организация, к которой относится касса</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <comment>Валюта, в которой работает ККМ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>МноговалютнаяКасса</name>
    <comment>Истина - деньги в кассе могут храниться в разных валютах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <comment>Кассир</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/КассыКомпании/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция определяет реквизиты выбранной кассы.
//
// Параметры:
//  Касса - СправочникСсылка.Кассы - Ссылка на кассу
//
// Возвращаемое значение:
//	Структура - Реквизиты выбранной кассы
//
Функция ПолучитьРеквизитыКассыКомпании(КассаКомпании) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КассыКомпании.Код КАК Код,
	                      |	КассыКомпании.Организация КАК Организация,
	                      |	КассыКомпании.Подразделение КАК Подразделение,
	                      |	КассыКомпании.Объект КАК Объект,
	                      |	КассыКомпании.ВалютаДенежныхСредств КАК Валюта,
	                      |	КассыКомпании.МноговалютнаяКасса КАК МноговалютнаяКасса,
	                      |	КассыКомпании.Кассир КАК Кассир,
	                      |	КассыКомпании.РегламентированныйУчет КАК РегламентированныйУчет,
	                      |	КассыКомпании.Лимит КАК Лимит
	                      |ИЗ
	                      |	Справочник.КассыКомпании КАК КассыКомпании
	                      |ГДЕ
	                      |	КассыКомпании.Ссылка = &КассаКомпании");
	
	Запрос.УстановитьПараметр("КассаКомпании", КассаКомпании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Код 			= Выборка.Код;
		Организация 	= Справочники.ТорговыеПлощадки.ОрганизацияТорговойПлощадки(Выборка.Объект,ТекущаяДатаСеанса());
		Подразделение	= Выборка.Подразделение;
		Объект			= Выборка.Объект;
		Валюта			= Выборка.Валюта;
		МноговалютнаяКасса = Выборка.МноговалютнаяКасса;
		Кассир			= Выборка.Кассир;
		РегламентированныйУчет = Выборка.РегламентированныйУчет;
		Лимит			= Выборка.Лимит;
	Иначе
		Код 			= "";
		Организация 	= Справочники.Организации.ПустаяСсылка();
		Подразделение	= Справочники.ПодразделенияКомпании.ПустаяСсылка();
		Объект			= Справочники.ТорговыеПлощадки.ПустаяСсылка();
		Валюта		    = Справочники.Валюты.ПустаяСсылка();
		МноговалютнаяКасса = Ложь;
		Кассир			= Справочники.ФизическиеЛица.ПустаяСсылка();
		РегламентированныйУчет = Ложь;
		Лимит			= 0;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Код, Организация, Подразделение, Объект, Валюта, МноговалютнаяКасса, Кассир, РегламентированныйУчет, Лимит",
		Код,
		Организация,
		Подразделение,
		Объект,
		Валюта,
		МноговалютнаяКасса,
		Кассир,
		РегламентированныйУчет,
		Лимит);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Возврат СтруктураРеквизитов;

КонецФункции

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ЗначениеРазрешено(Объект)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбработчикиСобытий


#КонецОбласти



#КонецЕсли
